//Операторы. Арифметические операции с числами.
#include<iostream>
using namespace std;

/*Операторы*/
// бинарные - это те операторы которым для действий нужен два операнта.
// тернарные - это те операторы которым для действий нужен три операнта.
// унарные - это те операторы которым для действий нужен один оперант.

//////////////////////// АРИФМЕТИЧЕСКИЕ ОПЕРАЦИИ
// + - сложение
// - - вычетание
// * - сложение
// / - деление
// % - деление на модуль
//////////////////////// ОПЕРАЦИИ РАВЕНСТВО
// == - равенство
// != - не равенство
/////////////////////// ОПЕРАЦИИ СРАВНЕНИЯ
// > - БОЛЬШЕ
// < - меньше
// >= больше или равно
// <= меньше или равно

void main()
{
	setlocale(LC_ALL, "ru");
	int a = 2, s = 4, f;
	f = a + s;
	cout << f << endl;


}